## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 16 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                         |
|----------|------------------------------------------------------|
| update   | `aws_lambda_function.audit_logs`                     |
|          | `aws_lambda_function.form_archiver`                  |
|          | `aws_lambda_function.nagware`                        |
|          | `aws_lambda_function.reliability`                    |
|          | `aws_lambda_function.reliability_dlq_consumer`       |
|          | `aws_lambda_function.response_archiver`              |
|          | `aws_lambda_function.submission`                     |
|          | `aws_lambda_function.vault_integrity`                |
|          | `aws_s3_bucket_object.audit_logs_code`               |
|          | `aws_s3_bucket_object.form_archiver_code`            |
|          | `aws_s3_bucket_object.nagware_code`                  |
|          | `aws_s3_bucket_object.reliability_code`              |
|          | `aws_s3_bucket_object.reliability_dlq_consumer_code` |
|          | `aws_s3_bucket_object.response_archiver_code`        |
|          | `aws_s3_bucket_object.submission_code`               |
|          | `aws_s3_bucket_object.vault_integrity_code`          |
| recreate | `aws_signer_signing_job.vault_integrity[0]`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "iMfvFxLKoRigCnZVFaJuLTUsn_6RFOu5" -> (known after apply)
      ~ source_code_hash               = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "suEJi8LvcrMKpgSz4zUOLgYlJAMJ57JtOek/WVoX83Q="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "j94rcpwyFRwAA7JXRDCDafL85O6hDx2J" -> (known after apply)
      ~ source_code_hash               = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "xIFwvkHAcaLWREkmZduAqmjZclpABEDNivdBoPoWprU="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2023-12-14T16:47:42.000+0000" -> (known after apply)
      ~ s3_object_version              = "TvJ2N1_.VVw5oGteCmT4AbDx3ioM1jrD" -> (known after apply)
      ~ source_code_hash               = "OcLo5We0JHv2naLzzmmeTs5+2hTEVT1bAlfB7LuxJFs=" -> "nfG4QzTPLEf8/YGasUQXjEKARoOfFReXomw6KBi8v38="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2023-12-13T19:30:42.000+0000" -> (known after apply)
      ~ s3_object_version              = "4Om4TGyikL91F7nkKFedil3uV.tyzsU6" -> (known after apply)
      ~ source_code_hash               = "nf3YFotstkw84Smj5lGE5Dft0jWhLgYZGsp2crPVU6Q=" -> "4ALCyHeTE2GsOND0i/8mVBO+6LsA4OQoSuKvCZpMeik="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "Reliability_DLQ_Consumer"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "cRf.Dj.LTDhuOUv.k5w6JGkAehmjZ9Ji" -> (known after apply)
      ~ source_code_hash               = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "bpJ+3LB465Dlmng8Ap1tD1RICBa24RNzkE8PDblNUDg="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "Response_Archiver"
      ~ last_modified                  = "2023-12-08T15:00:34.000+0000" -> (known after apply)
      ~ s3_object_version              = "FlkRJWeQrrZC4lwjiEbKG4vPnw__MBWu" -> (known after apply)
      ~ source_code_hash               = "HlOcaGXKLFMSZO3DF101vb5Af5YWWPGBw6Z16Zu9hVI=" -> "RO0A43Fzg17mvSAPaYRP/iUJvOT1qaEDpqNdpfkcpCs="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2023-12-08T15:00:34.000+0000" -> (known after apply)
      ~ s3_object_version              = "klyLdBblY5xlz0rQhwFtMCYOIZaIxbHS" -> (known after apply)
      ~ source_code_hash               = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "LVmNzke1mo4WNn0m9dhQWzQ3U7oD9myLbB1+Ix08Ry4="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2023-12-27T15:41:05.000+0000" -> (known after apply)
      ~ s3_bucket                      = "forms-staging-lambda-code" -> (known after apply)
      ~ s3_key                         = "signed/5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ source_code_hash               = "9opCvMNrZA+BCLvHUGkHDweCXfVwLgP5jcHfkTPLySc=" -> "Fqhrlo2Kbj/D8ICPs4OulInU34LDWEeFxbc6dVS1Wnk="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "suEJi8LvcrMKpgSz4zUOLgYlJAMJ57JtOek/WVoX83Q="
        tags                   = {}
      ~ version_id             = "iMfvFxLKoRigCnZVFaJuLTUsn_6RFOu5" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "xIFwvkHAcaLWREkmZduAqmjZclpABEDNivdBoPoWprU="
        tags                   = {}
      ~ version_id             = "j94rcpwyFRwAA7JXRDCDafL85O6hDx2J" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.nagware_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "OcLo5We0JHv2naLzzmmeTs5+2hTEVT1bAlfB7LuxJFs=" -> "nfG4QzTPLEf8/YGasUQXjEKARoOfFReXomw6KBi8v38="
        tags                   = {}
      ~ version_id             = "TvJ2N1_.VVw5oGteCmT4AbDx3ioM1jrD" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.reliability_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "nf3YFotstkw84Smj5lGE5Dft0jWhLgYZGsp2crPVU6Q=" -> "4ALCyHeTE2GsOND0i/8mVBO+6LsA4OQoSuKvCZpMeik="
        tags                   = {}
      ~ version_id             = "4Om4TGyikL91F7nkKFedil3uV.tyzsU6" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.reliability_dlq_consumer_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "reliability_dlq_consumer_code" {
        id                     = "reliability_dlq_consumer_code"
      ~ source_hash            = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "bpJ+3LB465Dlmng8Ap1tD1RICBa24RNzkE8PDblNUDg="
        tags                   = {}
      ~ version_id             = "cRf.Dj.LTDhuOUv.k5w6JGkAehmjZ9Ji" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.response_archiver_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "response_archiver_code" {
        id                     = "response_archiver_code"
      ~ source_hash            = "HlOcaGXKLFMSZO3DF101vb5Af5YWWPGBw6Z16Zu9hVI=" -> "RO0A43Fzg17mvSAPaYRP/iUJvOT1qaEDpqNdpfkcpCs="
        tags                   = {}
      ~ version_id             = "FlkRJWeQrrZC4lwjiEbKG4vPnw__MBWu" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.submission_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "LVmNzke1mo4WNn0m9dhQWzQ3U7oD9myLbB1+Ix08Ry4="
        tags                   = {}
      ~ version_id             = "klyLdBblY5xlz0rQhwFtMCYOIZaIxbHS" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.vault_integrity_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "vault_integrity_code" {
        id                     = "vault_integrity_code"
      ~ source_hash            = "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws=" -> "Fqhrlo2Kbj/D8ICPs4OulInU34LDWEeFxbc6dVS1Wnk="
        tags                   = {}
      ~ version_id             = "sQTR1bM5TctBB1gnxGI5GNQx3fnc7zbN" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_signer_signing_job.vault_integrity[0] must be replaced
-/+ resource "aws_signer_signing_job" "vault_integrity" {
      ~ completed_at               = "2023-12-07T21:57:02Z" -> (known after apply)
      ~ created_at                 = "2023-12-07T21:57:00Z" -> (known after apply)
      ~ id                         = "5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ job_id                     = "5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ job_invoker                = "687401027353" -> (known after apply)
      ~ job_owner                  = "687401027353" -> (known after apply)
      ~ platform_display_name      = "AWS Lambda" -> (known after apply)
      ~ platform_id                = "AWSLambda-SHA384-ECDSA" -> (known after apply)
      ~ profile_version            = "3cak3nO7rT" -> (known after apply)
      ~ requested_by               = "arn:aws:iam::687401027353:user/GitHub_Terraform" -> (known after apply)
      ~ revocation_record          = [] -> (known after apply)
      ~ signature_expires_at       = "2035-03-07T21:57:02Z" -> (known after apply)
      ~ signed_object              = [
          - {
              - s3 = [
                  - {
                      - bucket = "forms-staging-lambda-code"
                      - key    = "signed/5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24"
                    },
                ]
            },
        ] -> (known after apply)
      ~ status                     = "Succeeded" -> (known after apply)
      ~ status_reason              = "Signing Succeeded" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          ~ s3 {
              ~ version = "sQTR1bM5TctBB1gnxGI5GNQx3fnc7zbN" # forces replacement -> (known after apply) # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 16 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.audit_logs_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.form_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.nagware_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.reliability_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.reliability_dlq_consumer_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.response_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.submission_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.vault_integrity_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_signer_signing_profile.lambda_signing_profile[0]"]

40 tests, 19 passed, 21 warnings, 0...
```

</details>
